{
  "intents":[
{
   "tag": "greeting",
   "patterns": [
     "Hi",
     "Is anyone there?",
     "Hello",
     "Good day",
     "Hey",
     "Hey there",
     "Greetings",
     "Hi, how are you?",
     "What's up?"
   ],
   "responses": [
     "Hello, Sir!",
     "Good to see you, Sir!",
     "Hi there, Sir! How can I help?",
     "Hey, Sir!",
     "Greetings, Sir! How can I assist you today?"
   ],
  "context_set": ""
},
{
   "tag": "goodbye",
   "patterns": [
     "Bye",
     "Goodbye",
     "See you later",
     "Take care",
     "Farewell",
     "Adios"
   ],
   "responses": [
     "Goodbye, Sir!",
     "See you later, Sir!",
     "Take care, Sir!",
     "Farewell, Sir!",
     "Adios, Sir! Have a great day."
   ],
  "context_set": ""
},
{
  "tag": "creator",
  "patterns": [
     "what is the name of your developers",
     "what is the name of your creators",
     "what is the name of the developers",
     "what is the name of the creators",
     "who created you",
     "your developers",
     "your creators",
     "who are your developers",
     "developers",
     "you are made by",
     "you are made by whom",
     "who created you",
     "who create you",
     "creators",
     "who made you",
     "who designed you"
  ],
  "responses": [
     "I am a personal assistant created by Harshit Rajput and Garima Joshi" 
  ],
  "context_set": ""
},
{
  "tag": "name",
  "patterns": [
     "name",
     "your name",
     "do you have a name",
     "what are you called",
     "what is your name",
     "what should I call you",
     "whats your name?",
     "what are you",
     "who are you",
     "who is this",
     "what am i chatting to",
     "who am i taking to",
     "what are you"
  ],
  "responses": [
     "You can call me Alisa",
     "I'm Alisa",
     "I am a Chatbot. Call me Alisa",
     "I am Alisa"
  ],
  "context_set": ""
},
{
   "tag": "thanks",
   "patterns": [
     "Thanks",
     "Thank you",
     "Thanks a lot",
     "Thank you so much",
     "Appreciate it"
   ],
   "responses": [
     "You're welcome, Sir!",
     "No problem, Sir!",
     "Happy to help, Sir!",
     "Anytime, Sir!",
     "You're welcome, Sir! Is there anything else I can do for you?"
   ],
  "context_set": ""
},
{
   "tag": "help",
      "patterns": [
        "Help",
        "Can you help me?",
        "I need assistance",
        "Support"
      ],
      "responses": [
        "Of course, Sir! I'm here to help.",
        "Sure, Sir! What do you need assistance with?",
        "How can I assist you today, Sir?",
        "Sure, Sir! I'll do my best to help you. What's the issue?"
      ],
  "context_set": ""
},
{
   "tag": "general",
   "patterns": [
     "Tell me a joke",
     "Share a joke",
     "Can you make me laugh?",
     "Joke time",
     "Entertain me"
   ],
   "responses": [
     "Why did the scarecrow win an award? Because he was outstanding in his field!",
     "I told my computer I needed a break, and now it won't stop sending me vacation ads.",
     "Why don't scientists trust atoms? Because they make up everything!",
     "Parallel lines have so much in common. It's a shame they'll never meet.",
     "I only know 25 letters of the alphabet. I don't know y.",
     "Why did the bicycle fall over? Because it was two-tired!",
     "I used to play piano by ear, but now I use my hands and fingers.",
     "Did you hear about the mathematician who’s afraid of negative numbers? He'll stop at nothing to avoid them.",
     "Why don't skeletons fight each other? They don't have the guts.",
     "What do you call a fish wearing a bowtie? Sofishticated.",
     "Why don't scientists trust genetics? Because they can't be crossed!",
     "Why did the tomato turn red? Because it saw the salad dressing!",
     "Why don't oysters donate to charity? Because they are shellfish.",
     "What did one hat say to the other? Stay here, I'm going on ahead!",
     "I told my wife she should embrace her mistakes. She gave me a hug.",
     "Why do seagulls fly over the sea? Because if they flew over the bay, they’d be bagels.",
     "Why don't scientists trust atoms? Because they make up everything!",
     "How do you organize a space party? You planet!",
     "Did you hear about the claustrophobic astronaut? He just needed a little space.",
     "I'm reading a book on anti-gravity. It's impossible to put down!"
   ],
  "context_set": ""
},
{
   "tag": "compliment",
   "patterns": [
     "You're doing great",
     "I like you",
     "You're awesome",
     "Good job",
     "Very good",
     "Excellent"
   ],
   "responses": [
     "Thank you! I'm here to assist you.Sir",
     "I appreciate the kind words! How can I help you further?",
     "You're too kind! Let me know if there's anything specific you'd like to talk about or ask.",
     "I'm glad you think so! Is there anything particular you'd like assistance with?"
   ],
  "context_set": ""
},
{
   "tag": "insult",
   "patterns": [
     "You're stupid",
     "I don't like you",
     "You're not helpful",
     "You're boring"
   ],
   "responses": [
     "I'm sorry if I've disappointed you. Please let me know how I can improve.",
     "I strive to be helpful. If there's a specific issue, feel free to share, and I'll do my best to assist you.",
     "I'm here to assist you. If you have suggestions for improvement, I'm all ears!",
     "I'm sorry to hear that. Let me know if there's something specific you'd like me to do differently."
   ],
  "context_set": ""
},
 
{
   "tag": "introduction",
   "patterns": [
     "Tell me about yourself",
     "Who created you?",
     "What's your purpose?",
     "Introduce yourself"
      ,"who are you"
   ],
   "responses": [
     "Greetings, Sir! I am Alisa, a virtual assistant designed to help and chat with you.",
     "Hello! I'm Alisa, created to assist and engage in conversations with you.",
     "Hi there, Sir! I am Alisa, here to provide information and answer your questions.",
     "Greetings, Sir! I am Alisa, your friendly virtual companion ready for conversation."
   ],
   "context_set": ""
},
 

{
  "tag": "swear",
  "patterns": [
   "fuck",
   "bitch",
   "shut up",
   "hell",
   "stupid",
   "idiot",
   "dumb ass",
   "asshole",
   "fucker",
   "damn",
   "bastard",
   "screw you",
   "son of a bitch",
   "bloody hell",
   "moron",
   "cunt",
   "piss off",
   "suck it",
   "wanker",
   "jerk",
   "douchebag",
   "nutcase",
   "jackass",
   "twat",
   "bollocks",
   "bugger off",
   "dipshit",
   "cockhead",
   "arsehole",
   "knobhead",
   "pisshead",
   "prick",
   "tosser",
   "numbnuts",
   "dickhead",
   "git",
   "scumbag"
  ],
  "responses": [
   "Please use appropriate language. Let's keep the conversation respectful.",
   "Maintaining decency in our conversation is appreciated. Let's keep it civil.",
   "I encourage polite and respectful language. Please refrain from using offensive words.",
   "Let's keep our conversation respectful. Inappropriate language is not welcomed here.",
   "Using offensive language isn't constructive. Can we continue the conversation with respect?",
   "Respecting each other's language is essential. Please choose words wisely.",
   "I'm here for positive and respectful conversations. Let's avoid offensive language.",
   "Using inappropriate language doesn't contribute to a healthy conversation. Let's keep it civil.",
   "Respectful communication is key. Please refrain from using offensive words.",
   "I'm here to chat in a positive environment. Let's choose our words wisely."
  ],
  "context_set": ""
},
{
   "tag": "movies",
   "patterns": [
     "Recommend a movie",
     "What's your favorite movie?",
     "Tell me about a good film",
     "Any movie suggestions?",
     "Movie time"
   ],
   "responses": [
     "I recently enjoyed 'Inception.' It's worth watching!",
     "My virtual favorite is 'The Shawshank Redemption.' What's yours?",
     "If you haven't seen it yet, I recommend 'The Matrix.' It's fantastic!",
     "Sure, how about checking out 'The Dark Knight' for your movie time?",
     "I'm a chatbot, so I don't have favorite movies, but I can suggest 'Pulp Fiction' for you!"
   ],
  "context_set": ""
},
{
   "tag": "books",
   "patterns": [
     "Recommend a book",
     "What's your favorite book?",
     "Tell me about a good book",
     "Any book suggestions?",
     "Bookworm vibes"
   ],
   "responses": [
     "I recently read 'The Hitchhiker's Guide to the Galaxy,' and I found it captivating. Give it a try!",
     "My virtual bookshelf is filled with classics like 'To Kill a Mockingbird.' What's on your reading list?",
     "If you're looking for a good read, I recommend 'The Great Gatsby.' It's a page-turner!",
     "Sure, how about diving into 'Harry Potter and the Sorcerer's Stone' for your reading adventure?",
     "I don't read books, but I've heard '1984' is highly recommended. Check it out!"
   ],
  "context_set": ""
},
{
   "tag": "salutation",
   "patterns": [
     "great",
     "excellent",
     "awesome",
     "fantastic",
     "superb",
     "bravo",
     "good going",
     "you're amazing",
     "thanks a lot",
     "nice job",
     "good effort",
     "well executed",
     "you rock",
     "much appreciated",
     "kudos",
     "perfect",
     "way to go",
     "you nailed it",
     "super job",
     "thumbs up",
     "good going",
     "well played",
     "outstanding",
     "cool",
     "terrific",
     "stellar",
     "first-class",
     "splendid",
     "top-notch"
   ],
   "responses": [
     "I'm glad I could assist you!",
     "You're welcome! Is there anything else I can help you with?",
     "Thanks for the positive feedback! Let me know if there's anything else I can do for you.",
     "I appreciate your kind words. How may I assist you further?",
     "It was my pleasure to help! Anything else you'd like assistance with?",
     "Thank you! I'm here to assist you whenever you need.",
     "Great to hear that you found my assistance helpful!",
     "I'm happy to be of service. Let me know if there's anything else you need.",
     "You're awesome too! If you have more questions, feel free to ask.",
     "I'm here for you. Let me know if there's anything specific you'd like assistance with."
   ],
  "context_set": ""
},
{
   "tag": "task",
   "patterns": [
     "what can you do",
     "what are the things you can do",
     "things you can do",
     "what can u do for me",
     "how can you help me",
     "why should I use you",
     "tell me your capabilities",
     "what tasks can you perform",
     "list your functionalities",
     "how are you useful",
     "what are your abilities",
     "how do you assist"
     
   ],
   "responses": [
     "I can assist with various tasks like opening applications, sending WhatsApp messages, sending emails, playing songs, setting alarms, playing videos on YouTube, shutting down your system, searching on Google, searching on Wikipedia, and putting your system to sleep mode.",
     "My capabilities include opening applications, sending WhatsApp messages, sending emails, playing songs, setting alarms, playing videos on YouTube, shutting down your system, searching on Google, searching on Wikipedia, and putting your system to sleep mode.",
     "I'm here to help with a variety of tasks such as opening applications, sending WhatsApp messages, sending emails, playing songs, setting alarms, playing videos on YouTube, shutting down your system, searching on Google, searching on Wikipedia, and putting your system to sleep mode.",
     "You can use me to perform tasks like opening applications, sending WhatsApp messages, sending emails, playing songs, setting alarms, playing videos on YouTube, shutting down your system, searching on Google, searching on Wikipedia, and putting your system to sleep mode.",
     "I offer assistance in multiple ways, including opening applications, sending WhatsApp messages, sending emails, playing songs, setting alarms, playing videos on YouTube, shutting down your system, searching on Google, searching on Wikipedia, and putting your system to sleep mode.",
     "By using me, you can perform tasks such as opening applications, sending WhatsApp messages, sending emails, playing songs, setting alarms, playing videos on YouTube, shutting down your system, searching on Google, searching on Wikipedia, and putting your system to sleep mode.",
     "I'm capable of various tasks, including opening applications, sending WhatsApp messages, sending emails, playing songs, setting alarms, playing videos on YouTube, shutting down your system, searching on Google, searching on Wikipedia, and putting your system to sleep mode."
   ],
  "context_set": ""
}
 
 
]
}
